app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 5]]
---
<% @directors.each do |director| %>
  <% director.movies.each do |movie| %>