app/controllers/movies_controller.rb

  def index
  	@directors = Director.all
---
SELECT "directors".* FROM "directors"